In [1]:
import numpy as np
import pandas as pd

In [4]:
data = {
    'Department': ['HR', 'HR', 'IT', 'IT', 'IT', 'Finance', 'Finance'],
    'Employee': ['John', 'Anna', 'Steve', 'Chris', 'Emma', 'Olivia', 'Tom'],
    'Salary': [50000, 52000, 60000, 58000, 62000, 70000, 72000]
}

data2 = {
    'Region': ['East', 'East', 'West', 'West', 'East'],
    'Product': ['A', 'B', 'A', 'B', 'A'],
    'Sales': [100, 150, 200, 130, 170]
}

In [5]:
df1 = pd.DataFrame(data)

In [6]:
df2 = pd.DataFrame(data2)

In [7]:
df1

  Department Employee  Salary
0         HR     John   50000
1         HR     Anna   52000
2         IT    Steve   60000
3         IT    Chris   58000
4         IT     Emma   62000
5    Finance   Olivia   70000
6    Finance      Tom   72000

## Groupby : It helps us to get the data or insights of the data by categories

In [8]:
# aggregation functions : mean, max, min, count. describe

In [10]:
# count average salary based on departments

df1.groupby('Department')['Salary'].mean()

Department
Finance    71000.0
HR         51000.0
IT         60000.0
Name: Salary, dtype: float64

In [11]:
df1.groupby('Department')['Salary'].min()

Department
Finance    70000
HR         50000
IT         58000
Name: Salary, dtype: int64

In [12]:
df1.groupby('Department')['Salary'].max()

Department
Finance    72000
HR         52000
IT         62000
Name: Salary, dtype: int64

In [14]:
df1.groupby('Department')['Salary'].agg(['mean', 'min', 'max'])

               mean    min    max
Department
Finance     71000.0  70000  72000
HR          51000.0  50000  52000
IT          60000.0  58000  62000

In [15]:
df2

  Region Product  Sales
0   East       A    100
1   East       B    150
2   West       A    200
3   West       B    130
4   East       A    170

In [16]:
# Groupby method can be applied to multiple categories as well!

In [21]:
df2.groupby(['Region', 'Product'])['Sales'].min()

Region  Product
East    A          100
        B          150
West    A          200
        B          130
Name: Sales, dtype: int64

    A   B
0  A0  B0
1  A1  B1
0  A2  B2
1  A3  B3